/*
Задайте прямоугольный двумерный массив. Напишите программу, которая будет находить строку с наименьшей суммой элементов.

Например, задан массив:
1 4 7 2
5 9 2 3
8 4 2 4
5 2 6 7
Программа считает сумму элементов в каждой строке и выдаёт номер строки с наименьшей суммой элементов: 1 строка
*/

int InputNum(string message)
{
    Console.Write(message);
    return int.Parse(Console.ReadLine()!);
}

int[,] Create2DArray(int rows, int columns)
{
    return new int[rows, columns];
}

void Fill2DArray(int[,] array, int min, int max)
{
    Random rnd = new Random();
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            array[i, j] = rnd.Next(min, max + 1);
        }
    }
}

void Print2DArray(int[,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            Console.Write($"{array[i, j]}\t");
        }
        Console.WriteLine();
    }
}

int FindRowMinSum(int[,] array)
{
    int minSum = int.MaxValue;   // максимально значение для переменной int = 2147483647
    int minRow = 0;

    for (int i = 0; i < array.GetLength(0); i++)
    {
        int sum = 0;  // обнуляем сумму
        for (int j = 0; j < array.GetLength(1); j++) 
        {
            sum += array[i, j];
        }
        if (sum < minSum)
        {
            minSum = sum;
            minRow = i;
            
        }
    } return minRow;
}

int rows = InputNum("Введите количество строк: ");
int columns = InputNum("Введите количество столбцов: ");
int minValue = InputNum("Введите минимальное значение диапазона: ");
int maxValue = InputNum("Введите максимально значение диапазона: ");

int[,] myArray = Create2DArray(rows, columns);
Fill2DArray(myArray, minValue, maxValue);
Print2DArray(myArray);

int rowResult = FindRowMinSum(myArray);
Console.WriteLine($"Номер строки с наименьшей суммой элементов: {rowResult + 1} строка"); // + 1 для читаемости